"""
赋值（=）并不会创建新对象，而是让两个变量指向同一个内存地址
"""
# 1 赋值

a = [1,2,3,4]
b = a
b.append(5)
print(a) # [1,2,3,4,5] 修改b，a也变了

"""
要想真正复制一个对象，需要使用拷贝
浅拷贝：创建一个新的对象，但若复制对象是一个嵌套的容器,只复制最外层容器本身，和原对象共享一个内层元素
深拷贝：递归地复制对象及其所有的嵌套的子对象，创建完全独立的副本，修改内存元素不会影响原对象
    * 耗时更多，占用的内存更大
"""
import copy

# 2 浅拷贝
a = [1,2,3,4]
b = copy.copy(a)

# 2.1
b.append(5)
print(a) # [1,2,3,4]
# 2.2
b[0] = 10
print(a) # [1,2,3,4]
print(b) # [10,2,3,4,5]
# 嵌套结构的拷贝
c = [[1,2],[3,4]]
d = copy.copy(c)
# 2.3 修改外层容器
d.append([5,6])
print(c) # [[1,2],[3,4]] 不会影响到原对象
print(d) # [[1,2],[3,4],[5,6]]
# 2.4 修改内层可变元素
d[0][0] = 100
print(c) # [[100,2],[3,4]] 受影响，两者共享一个内层对象
print(d) # [[100,2],[3,4],[5,6]]

# 3 深拷贝
a = [[1,2],[3,4]]
b = copy.deepcopy(a)
# 3.1
b[0][0] = 100
print(a) # [[1,2],[3,4]] 不受影响
print(b) # [[100,2],[3,4]]

"""
对于不可变对象，如数字、字符串、元组，浅拷贝和深拷贝都不会真正复制，而是直接返回原对象
不可变对象不可更改，复制没有意义
"""
# 4 不可变对象

# 4.1 元组中包含可变对象
a = ([1,2],[3,4])
b = copy.copy(a)
c = copy.deepcopy(a)
print(b is a) # True 浅拷贝对不可变对象返回原对象 a的内层元素变换，b随之改变
print(c is a) # False 深拷贝不会复制元组本身，而是递归复制所有可变子对象，是一个全新的元组，a的变换与c无关